       IDENTIFICATION DIVISION.
       PROGRAM-ID. MACAPP.
      *PROGRAMA QUE CALCULA LOS SUELDOS NETOS DE LOS CURRANTES
      *DIEZ QUE SE INTRODUCEN POR TECLAS
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-400Mb.
       OBJECT-COMPUTER. IBM-400Mb.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NADA PIC X.
       01 LIN.
           02 SITIO PIC 99.
           02 REPETICION PIC 99.
       01 VENT.
           02 CUADRA PIC 9(8).
           02 HELP PIC 9(8).
       PROCEDURE DIVISION.
       MAIN.
           MOVE 00002570 TO CUADRA
           MOVE 65000001 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 3 TO SITIO
           MOVE 5 TO REPETICION.
           CALL "LINH.COB" USING VENT LIN
           MOVE 3 TO SITIO
           MOVE 5 TO REPETICION.
           CALL "LINV.COB" USING VENT LIN
           MOVE 07072020 TO CUADRA
           MOVE 43131300 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 0600 TO LIN
           CALL "LINH.COB" USING VENT LIN
           MOVE 0600 TO LIN
           CALL "LINV.COB" USING VENT LIN
           MOVE 15102479 TO CUADRA
           MOVE 54000101 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 0103 TO LIN
           CALL "LINH.COB" USING VENT LIN
           MOVE 0103 TO LIN
           CALL "LINV.COB" USING VENT LIN
           ACCEPT NADA LINE 0 POSITION 0
           STOP RUN.