       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUELDO.
      *PROGRAMA QUE CALCULA LOS SUELDOS NETOS DE LOS CURRANTES
      *DIEZ QUE SE INTRODUCEN POR TECLAS
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-400Mb.
       OBJECT-COMPUTER. IBM-400Mb.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T-CURRANTE.
           02 ELEMENTO OCCURS 10.
             03 CODIGO PIC 9(3).
             03 ANT PIC 99.
             03 CAT PIC 9.
             03 SBASE PIC 9(5).
             03 BON PIC 9(5).
             03 SBRUTO PIC 9(6).
             03 DED PIC 9(5).
             03 SNETO PIC 9(5).
       77 ESTNETO PIC ZZZ.ZZZ.ZZ9.
       77 CONT PIC 9(2).
       77 LINEA PIC 9(2).
       77 NADA PIC X.
       77 ECODIGO PIC ZZ9.
       77 EANT PIC Z9.
       77 ESBASE PIC ZZ.ZZ9.
       77 EBON PIC ZZ.ZZ9.
       77 ESBRUTO PIC ZZZ.ZZ9.
       77 EDED PIC ZZ.ZZ9.
       77 ESNETO PIC ZZ.ZZ9.
       77 STNETO PIC 9(9).
       77 FALSO PIC 9 VALUE 0.
       77 CIERTO PIC 9 VALUE 1.
       77 ORDENADO PIC 9.
       77 BASE PIC 99.
       77 RTEMP PIC X(37).
       PROCEDURE DIVISION.
       MAIN.
           PERFORM CARGAR VARYING CONT FROM 1 BY 1 UNTIL CONT > 10
           PERFORM CALCULAR VARYING CONT FROM 1 BY 1 UNTIL CONT > 10
           PERFORM INIT-MOSTRAR
           PERFORM MOSTRAR VARYING CONT FROM 1 BY 1 UNTIL CONT > 10
           PERFORM FIN-MOSTRAR
           PERFORM ORDENAR
           PERFORM INIT-MOSTRAR
           PERFORM MOSTRAR VARYING CONT FROM 1 BY 1 UNTIL CONT > 10
           PERFORM FIN
           STOP RUN.
       CARGAR.
           DISPLAY " " ERASE
           DISPLAY "DATOS DE PERSONAL NUMERO: " LINE 5 POSITION 15
           DISPLAY CONT LINE 5 POSITION 43
           DISPLAY " CODIGO DEL CURRRANTE:" LINE 10 POSITION 10
           ACCEPT CODIGO(CONT) LINE 10 POSITION 33 TAB
           DISPLAY "SUELDO BASE" LINE 13 POSITION 10
           ACCEPT SBASE(CONT) LINE 13 POSITION 33 TAB
           PERFORM CTOLSBASE UNTIL SBASE(CONT) < 80000.
           DISPLAY "ANTIGUEDAD" LINE 16 POSITION 10
           ACCEPT ANT(CONT) LINE 16 POSITION 33 TAB
           DISPLAY "CATEGORIA:" LINE 19 POSITION 10
           ACCEPT CAT(CONT) LINE 19 POSITION 33
           PERFORM CTOLCAT UNTIL CAT(CONT) < 3 AND CAT(CONT) > 0.
       CTOLSBASE.
           DISPLAY "SUELDO BASE" LINE 13 POSITION 10
           ACCEPT SBASE(CONT) LINE 13 POSITION 33 TAB.
       CTOLCAT.
           DISPLAY "CATEGORIA:" LINE 19 POSITION 10
           ACCEPT CAT(CONT) LINE 19 POSITION 33.
       CALCULAR.
           IF ANT(CONT) > 10
                IF CAT(CONT) = 1
                    MOVE 15000 TO BON(CONT)
                    ADD BON(CONT) SBASE(CONT) TO SBRUTO(CONT)
                  ELSE
                    MOVE 10000 TO BON(CONT)
                    ADD BON(CONT) SBASE(CONT) TO SBRUTO(CONT)
                 END-IF
               ELSE
                  MOVE 5000 TO BON(CONT)
                  ADD BON(CONT) SBASE(CONT) TO SBRUTO(CONT)
           END-IF
           MULTIPLY 0,23 BY SBRUTO(CONT) GIVING DED(CONT)
           COMPUTE  SNETO(CONT) = SBRUTO(CONT) - DED(CONT)
           ADD SNETO(CONT)
            TO STNETO.
       MOSTRAR.
           MOVE CODIGO(CONT) TO ECODIGO
           MOVE ANT(CONT) TO EANT
           MOVE SBASE(CONT) TO ESBASE
           MOVE BON(CONT) TO EBON
           MOVE SBRUTO(CONT) TO ESBRUTO
           MOVE DED(CONT) TO EDED
           MOVE SNETO(CONT) TO ESNETO
           DISPLAY ECODIGO LINE LINEA POSITION 10
           DISPLAY CAT(CONT) LINE LINEA POSITION 19
           DISPLAY ESBASE LINE LINEA POSITION 31
           DISPLAY EBON LINE LINEA POSITION 40
           DISPLAY ESBRUTO LINE LINEA POSITION 50
           DISPLAY EDED LINE LINEA POSITION 60
           DISPLAY ESNETO LINE LINEA POSITION 69
           ADD 1 TO LINEA.
       ORDENAR.
           MOVE FALSO TO ORDENADO.
           MOVE 10 TO BASE.
           PERFORM BUCLEORD UNTIL ORDENADO = CIERTO.
       BUCLEORD.
           MOVE CIERTO TO ORDENADO.
           PERFORM COLOCAR VARYING CONT FROM 1 BY 1 UNTIL CONT = BASE.
           COMPUTE BASE = BASE - 1.
       COLOCAR.
           IF SNETO(CONT) < SNETO(CONT + 1)
              MOVE ELEMENTO(CONT) TO RTEMP
              MOVE ELEMENTO(CONT + 1) TO ELEMENTO(CONT)
              MOVE RTEMP TO ELEMENTO(CONT + 1)
              MOVE FALSO TO ORDENADO
           END-IF.
       FIN-MOSTRAR.
           MOVE STNETO TO ESTNETO
           ADD 4 TO LINEA
           DISPLAY "S.TOTAL SUELDOS NETOS:" LINE LINEA POSITION 40
           DISPLAY ESTNETO LINE LINEA POSITION 63
           ACCEPT NADA.
       INIT-MOSTRAR.
           MOVE 10 TO LINEA
           DISPLAY " " ERASE
           DISPLAY "PULSE UNA TECLA PARA EMPEZAR EL PROCESO"
           LINE 2 POSITION 5 BLINK BEEP REVERSE.
           ACCEPT NADA.
       FIN.
           ACCEPT NADA.