       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL AGENDA ASSIGN TO RANDOM "AGENDA.DAT".
           SELECT LISTADO ASSIGN TO PRINT "PRINTER".
       DATA DIVISION.
       FILE SECTION.
       FD LISTADO LABEL RECORD OMITTED.
       01 LINEA PIC X(80).
       FD AGENDA LABEL RECORD STANDARD.
       01 REG-AGENDA.
          02 NOMBRE PIC X(10).
          02 APELLIDO1 PIC X(10).
          02 APELLIDO2 PIC X(10).
          02 DIRECCION PIC X(20).
          02 LOCALIDAD PIC X(15).
          02 PROVINCIA PIC X(15).
          02 TELEFONO PIC X(7).
       WORKING-STORAGE SECTION.
       77 CONTINUAR PIC X.
       PROCEDURE DIVISION.
       MAIN.
           OPEN EXTEND AGENDA.
           MOVE 'S' TO CONTINUAR
           PERFORM CARGAR UNTIL CONTINUAR = 'N'
           CLOSE AGENDA
           EXIT PROGRAM.
       CARGAR.
           DISPLAY " " ERASE
           DISPLAY "FICHERO AGENDA" LINE 5 POSITION 33
           DISPLAY "--------------" LINE 6 POSITION 33
           DISPLAY "NOMBRE...:" LINE 8 POSITION 10
           ACCEPT NOMBRE LINE 8 POSITION 23 TAB
           DISPLAY "APELLIDO1:" LINE 10 POSITION 10
           ACCEPT APELLIDO1 LINE 10 POSITION 23 TAB
           DISPLAY "APELLIDO2:" LINE 12 POSITION 10
           ACCEPT APELLIDO2 LINE 12 POSITION 23 TAB
           DISPLAY "DIRECCION:" LINE 14 POSITION 10
           ACCEPT DIRECCION LINE 14 POSITION 23 TAB
           DISPLAY "LOCALIDAD:" LINE 16 POSITION 10
           ACCEPT LOCALIDAD LINE 16 POSITION 23  TAB
           DISPLAY "PROVINCIA:" LINE 18 POSITION 10
           ACCEPT PROVINCIA LINE 18 POSITION 23 TAB
           DISPLAY "TELEFONO.:" LINE 20 POSITION 10
           ACCEPT TELEFONO LINE 20 POSITION 23 TAB
           DISPLAY ALL " " SIZE 80 LINE 23 POSITION 1 REVERSE
           DISPLAY "¨DESEA CONTINUAR S/N?" LINE 23 POSITION 50
           ACCEPT CONTINUAR LINE 23 POSITION 73 UPDATE TAB
           WRITE  REG-AGENDA.

