
       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT AGENDA ASSIGN TO RANDOM "AGENDA.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD AGENDA LABEL RECORD STANDARD.
       01 REG-AGENDA.
          02 NOMBRE PIC X(10).
          02 APELLIDO1 PIC X(10).
          02 APELLIDO2 PIC X(10).
          02 DIRECCION PIC X(20).
          02 LOCALIDAD PIC X(15).
          02 PROVINCIA PIC X(15).
          02 TELEFONO PIC X(7).
       WORKING-STORAGE SECTION.
       77 CONTINUAR PIC X.
       77 TUNAME PIC X(10).
       77 FIN PIC X.
       77 ENCONTRADO PIC 9.
       77 NADA PIC X.
       PROCEDURE DIVISION.
       MAIN.
           MOVE 'S' TO CONTINUAR
           PERFORM CONSULTAR UNTIL CONTINUAR = 'N' OR 'n'
           EXIT PROGRAM.
       CONSULTAR.
           OPEN INPUT AGENDA
           DISPLAY " " ERASE
           DISPLAY "CONSULTA AGENDA " LINE 5 POSITION 33
           DISPLAY "INTRODUZCA EL NOMBRE  DE LA PERSONA A LOCALIZAR:"
           LINE 7 POSITION 6.
           ACCEPT TUNAME LINE 7 POSITION 57 TAB
           MOVE 0 TO FIN
           MOVE 0 TO ENCONTRADO
           PERFORM BUSCAR UNTIL FIN = 1
           CLOSE AGENDA
           IF ENCONTRADO = 0
             DISPLAY "PERSONA NO ENCONTRADA" LINE 15 POSITION 30
           END-IF.
           PERFORM CONTINUAR.
       BUSCAR.
           READ AGENDA AT END MOVE 1 TO FIN.
           IF TUNAME = NOMBRE
                PERFORM VISUALIZAR
                MOVE 1 TO ENCONTRADO
           END-IF.
       VISUALIZAR.
           DISPLAY " " ERASE
           DISPLAY "CONSULTA FICHERO AGENDA" LINE 5 POSITION 29
           DISPLAY "-----------------------" LINE 6 POSITION 29
           DISPLAY "NOMBRE...:" LINE 8 POSITION 10
           DISPLAY NOMBRE LINE 8 POSITION 23
           DISPLAY "APELLIDO1:" LINE 10 POSITION 10
           DISPLAY APELLIDO1 LINE 10 POSITION 23
           DISPLAY "APELLIDO2:" LINE 12 POSITION 10
           DISPLAY APELLIDO2 LINE 12 POSITION 23
           DISPLAY "DIRECCION:" LINE 14 POSITION 10
           DISPLAY DIRECCION LINE 14 POSITION 23
           DISPLAY "LOCALIDAD:" LINE 16 POSITION 10
           DISPLAY LOCALIDAD LINE 16 POSITION 23
           DISPLAY "PROVINCIA:" LINE 18 POSITION 10
           DISPLAY PROVINCIA LINE 18 POSITION 23
           DISPLAY "TELEFONO.:" LINE 20 POSITION 10
           DISPLAY TELEFONO LINE 20 POSITION 23
           DISPLAY ALL " " SIZE 80 LINE 23 POSITION 1 REVERSE
           ACCEPT NADA.
       CONTINUAR.
           DISPLAY "¨DESEA CONTINUAR S/N?" LINE 23 POSITION 50
           ACCEPT CONTINUAR LINE 23 POSITION 73 UPDATE TAB.


