       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT AGENDA ASSIGN TO RANDOM "AGENDA.DAT".
           SELECT LISTADO ASSIGN TO PRINT "PRINTER".
       DATA DIVISION.
       FILE SECTION.
       FD AGENDA LABEL RECORD STANDARD.
       01 REG-AGENDA.
           02 NOMBRE PIC X(10).
           02 APELLIDO1 PIC X(10).
           02 APELLIDO2 PIC X(10).
           02 DIRECCION PIC X(20).
           02 LOCALIDAD PIC X(15).
           02 PROVINCIA PIC X(15).
           02 TELEFONO PIC X(7).
       FD LISTADO LABEL RECORD OMITTED.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       77 FIN PIC X.
       01 CABECERAS.
           02 FILLER  PIC X(22) VALUE " NOMBRE      APELLIDO1".
           02 FILLER  PIC X(27) VALUE "      DIRECC      LOCALIDAD".
           02 FILLER  PIC X(29) VALUE "      PROVINCIA      TELEFONO".
       01 DETALLE.
           02 FILLER PIC X(1) VALUE SPACES.
           02 LNOMBRE PIC X(10).
           02 FILLER PIC X(2) VALUE SPACES.
           02 LAPELLIDO1 PIC X(10).
           02 FILLER PIC X(5) VALUE SPACES.
           02 LDIRECCION PIC X(10).
           02 FILLER PIC X(2) VALUE SPACES.
           02 LLOCALIDAD PIC X(14).
           02 FILLER PIC X(1) VALUE SPACES.
           02 LPROVINCIA PIC X(14).
           02 FILLER PIC X(1) VALUE SPACES.
           02 LTELEFONO PIC X(7).
       PROCEDURE DIVISION.
       MAIN.
           PERFORM IMPRIMIR.
           CLOSE LISTADO.
           EXIT PROGRAM.
       IMPRIMIR.
           OPEN INPUT AGENDA
           OPEN OUTPUT LISTADO
           DISPLAY " " ERASE
           DISPLAY "IMPRIMIR AGENDA" LINE 4 POSITION 33
           WRITE LINEA FROM CABECERAS BEFORE ADVANCING 2 LINE.
           MOVE "N" TO FIN
           READ AGENDA AT END MOVE 'S' TO FIN.
           PERFORM LEER UNTIL FIN = 'S'
           CLOSE AGENDA.
       LEER.
           MOVE NOMBRE TO LNOMBRE.
           MOVE APELLIDO1 TO LAPELLIDO1.
           MOVE DIRECCION TO LDIRECCION.
           MOVE LOCALIDAD TO LLOCALIDAD.
           MOVE PROVINCIA TO LPROVINCIA.
           MOVE TELEFONO TO LTELEFONO.
           WRITE LINEA FROM DETALLE BEFORE ADVANCING 1 LINE.
           READ AGENDA AT END MOVE 'S' TO FIN.

