       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT AGENDA ASSIGN TO RANDOM "AGENDA.DAT".
           SELECT COMODIN ASSIGN TO RANDOM "COMODIN.DAT".
           SELECT ORDENADO ASSIGN TO SORT-WORK.
       DATA DIVISION.
       FILE SECTION.
       FD AGENDA LABEL RECORD STANDARD.
       01 REG-AGENDA.
           02 NOMBRE PIC X(10).
           02 APELLIDO1 PIC X(10).
           02 APELLIDO2 PIC X(10).
           02 DIRECCION PIC X(20).
           02 LOCALIDAD PIC X(15).
           02 PROVINCIA PIC X(15).
           02 TELEFONO PIC X(7).
       FD COMODIN LABEL RECORD STANDARD.
       01 REG-COM.
           02 NOMBRE1 PIC X(10).
           02 APELLIDO11 PIC X(10).
           02 APELLIDO21 PIC X(10).
           02 DIRECCION1 PIC X(20).
           02 LOCALIDAD1 PIC X(15).
           02 PROVINCIA1 PIC X(15).
           02 TELEFONO1 PIC X(7).
       SD ORDENADO.
       01 REG-ORD.
           02 NOMBRE2 PIC X(10).
           02 APELLIDO12 PIC X(10).
           02 APELLIDO22 PIC X(10).
           02 DIRECCION2 PIC X(20).
           02 LOCALIDAD2 PIC X(15).
           02 PROVINCIA2 PIC X(15).
           02 TELEFONO2 PIC X(7).
       WORKING-STORAGE SECTION.
       77 CONTINUAR PIC X.
       77 TUNAME PIC X(10).
       77 FIN PIC X.
       77 LINEA PIC 99.
       77 NADA PIC X.
       PROCEDURE DIVISION.
       MAIN.
           PERFORM ORDENAR.
           PERFORM CONSULTAR.
           ACCEPT NADA.
           EXIT PROGRAM.
       CONSULTAR.
           OPEN INPUT AGENDA
           DISPLAY " " ERASE
           DISPLAY "LISTADO AGENDA" LINE 4 POSITION 33
           DISPLAY "NOMBRE     APELLIDO1   DIRECCION" LINE 5 POSITION 1
           DISPLAY "LOCALIDAD        PROVINCIA        TELEFONO" LINE 5
           POSITION 35.
           MOVE 6 TO LINEA
           MOVE "N" TO FIN
           READ AGENDA AT END MOVE 'S' TO FIN.
           PERFORM VISUALIZAR UNTIL FIN = 'S'
           CLOSE AGENDA.
       VISUALIZAR.
           DISPLAY NOMBRE LINE LINEA POSITION 1
           DISPLAY APELLIDO1 LINE LINEA POSITION 12
           DISPLAY DIRECCION LINE LINEA POSITION 24
           DISPLAY LOCALIDAD LINE LINEA POSITION 35
           DISPLAY PROVINCIA LINE LINEA POSITION 52
           DISPLAY TELEFONO LINE LINEA POSITION 69
           COMPUTE LINEA = LINEA + 1.
           READ AGENDA AT END MOVE 'S' TO FIN.
       CONTINUAR.
           DISPLAY "¨DESEA CONTINUAR S/N?" LINE 23 POSITION 50
           ACCEPT CONTINUAR LINE 23 POSITION 73 UPDATE TAB.
       ORDENAR.
           SORT ORDENADO ON ASCENDING KEY NOMBRE2 USING AGENDA GIVING
           COMODIN.
           OPEN INPUT COMODIN.
           OPEN OUTPUT AGENDA.
           MOVE 'N' TO FIN.
           READ COMODIN AT END MOVE 'S' TO FIN.
           PERFORM TRASPASO UNTIL FIN = 'S'.
           CLOSE AGENDA COMODIN.
       TRASPASO.
           IF NOMBRE1 NOT = "**********"
               WRITE REG-AGENDA FROM REG-COM.
           READ COMODIN AT END MOVE 'S' TO FIN.

