       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 TECLA1 PIC 99 COMP.
       77 TECLA PIC 99.
       PROCEDURE DIVISION.
       MAIN.
           PERFORM MEN WITH TEST AFTER UNTIL TECLA1 = 27.
           STOP RUN.
       MEN.
           DISPLAY " " ERASE
           DISPLAY "FICHERO AGENDA" LINE 2 POSITION 32
           DISPLAY " ESC: SALIR" LINE 3 POSITION 10
           DISPLAY " F1: CREACCION Y ALTAS" LINE 5 POSITION 10
           DISPLAY " F2: CONSULTAR " LINE 7 POSITION 10
           DISPLAY " F3: LISTADO" LINE 9 POSITION 10
           DISPLAY " F4: MODIFICACIONES" LINE 11 POSITION 10
           DISPLAY " F5: BAJA" LINE 13 POSITION 10
           DISPLAY " F6: LISTADO POR IMPRESORA" LINE 15 POSITION 10
           DISPLAY " INTRODUZCA LA OPCION DESEADA" LINE 18 POSITION 10
           MOVE  0 TO TECLA1
           MOVE  0 TO TECLA
           ACCEPT TECLA LINE 18 POSITION 50 ON EXCEPTION TECLA1
           EVALUATE TECLA1
               WHEN 1 CALL "4AGENDA.COB"
               WHEN 2 CALL "4CONSULT.COB"
               WHEN 3 CALL "4LISTADO.COB"
               WHEN 4 CALL "4MODIFIC.COB"
               WHEN 5 CALL "4BAJA.COB"
               WHEN 6 CALL "4IMPRESO.COB"
               WHEN 27 CONTINUE
               WHEN OTHER DISPLAY "OPCION ERRONEA" LINE 23 POSITION 60
           END-EVALUATE
           END-ACCEPT.


