
       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT AGENDA ASSIGN TO RANDOM "AGENDA.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD AGENDA LABEL RECORD STANDARD.
       01 REG-AGENDA.
          02 NOMBRE PIC X(10).
          02 APELLIDO1 PIC X(10).
          02 APELLIDO2 PIC X(10).
          02 DIRECCION PIC X(20).
          02 LOCALIDAD PIC X(15).
          02 PROVINCIA PIC X(15).
          02 TELEFONO PIC X(7).
       WORKING-STORAGE SECTION.
       77 CONTINUAR PIC X.
       77 TUNAME PIC X(10).
       77 FIN PIC X.
       77 ENCONTRADO PIC 9.
       77 NADA PIC X.
       PROCEDURE DIVISION.
       MAIN.
           MOVE 'S' TO CONTINUAR
           PERFORM CONSULTAR UNTIL CONTINUAR = 'N' OR 'n'
           EXIT PROGRAM.
       CONSULTAR.
           OPEN I-O AGENDA
           DISPLAY " " ERASE
           DISPLAY "MODIFICACIONES AGENDA " LINE 5 POSITION 33
           DISPLAY "INTRODUZCA EL NOMBRE  DE LA PERSONA A MODIFICAR:"
           LINE 7 POSITION 6.
           ACCEPT TUNAME LINE 7 POSITION 57 TAB
           MOVE 0 TO FIN
           MOVE 0 TO ENCONTRADO
           READ AGENDA AT END MOVE 1 TO FIN.
           PERFORM BUSCAR UNTIL FIN = 1
           CLOSE AGENDA
           IF ENCONTRADO = 0
             DISPLAY "PERSONA NO ENCONTRADA" LINE 15 POSITION 30
           END-IF.
           PERFORM CONTINUAR.
       BUSCAR.
           IF TUNAME = NOMBRE
                PERFORM MODIFIC
                MOVE 1 TO ENCONTRADO
           END-IF.
           READ AGENDA AT END MOVE 1 TO FIN.
       MODIFIC.
           DISPLAY " " ERASE
           DISPLAY "MODIFICACIONES FICHERO AGENDA" LINE 5 POSITION 26
           DISPLAY "-----------------------" LINE 6 POSITION 29
           DISPLAY "NOMBRE...:" LINE 8 POSITION 10
           ACCEPT NOMBRE LINE 8 POSITION 23 UPDATE
           DISPLAY "APELLIDO1:" LINE 10 POSITION 10
           ACCEPT APELLIDO1 LINE 10 POSITION 23 UPDATE
           DISPLAY "APELLIDO2:" LINE 12 POSITION 10
           ACCEPT APELLIDO2 LINE 12 POSITION 23 UPDATE
           DISPLAY "DIRECCION:" LINE 14 POSITION 10
           ACCEPT DIRECCION LINE 14 POSITION 23 UPDATE
           DISPLAY "LOCALIDAD:" LINE 16 POSITION 10
           ACCEPT LOCALIDAD LINE 16 POSITION 23 UPDATE
           DISPLAY "PROVINCIA:" LINE 18 POSITION 10
           ACCEPT PROVINCIA LINE 18 POSITION 23 UPDATE
           DISPLAY "TELEFONO.:" LINE 20 POSITION 10
           ACCEPT TELEFONO LINE 20 POSITION 23 UPDATE TAB
           REWRITE REG-AGENDA.
           DISPLAY ALL " " SIZE 80 LINE 23 POSITION 1 REVERSE.
       CONTINUAR.
           MOVE 'S' TO CONTINUAR.
           DISPLAY "¨DESEA CONTINUAR S/N?" LINE 23 POSITION 50.
           ACCEPT CONTINUAR LINE 23 POSITION 73 UPDATE TAB.



