       IDENTIFICATION DIVISION.
       PROGRAM-ID. MENU.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. INVES-20Mb.
       OBJECT-COMPUTER. INVES-20Mb.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T-PRECIO.
         02 ARTICULO OCCURS 4.
           03 CALIDAD OCCURS 3.
             04 PRECIO PIC 9(4) OCCURS 2.
       77 I PIC 9.
       77 J PIC 9.
       77 K PIC 9.
       77 NADA PIC X.
       77 PREDIT PIC Z.ZZ9.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY " " ERASE.
           DISPLAY "CARGAR TABLA" LINE 5 POSITION 30 REVERSE BLINK.
           PERFORM CARGAR-ART VARYING I FROM 1 BY 1 UNTIL I > 4
           AFTER J FROM 1 BY 1 UNTIL J > 3 AFTER K FROM 1 BY 1
           UNTIL K > 2

           DISPLAY " " ERASE.
           DISPLAY "CONSULTAR TABLA" LINE 5 POSITION 30 REVERSE BLINK.
           DISPLAY "ARTICULO:" LINE 10 POSITION 15.
           ACCEPT I LINE 10 POSITION 25.
           PERFORM LEER-I UNTIL I < 5 AND I >= 0
           PERFORM ART UNTIL I = 0
           STOP RUN.

       ART.
           DISPLAY "CALIDAD:" LINE 11 POSITION 15
           ACCEPT J LINE 11 POSITION 25
           PERFORM LEER-J UNTIL J < 4 AND J > 0

           DISPLAY "TIPO-VTA:" LINE 12 POSITION 15
           ACCEPT K  LINE 12 POSITION 25
           PERFORM LEER-K UNTIL K < 3 AND K > 0
           DISPLAY "PRECIO:" REVERSE BLINK LINE 15 POSITION 15
           MOVE PRECIO (I, J, K) TO PREDIT
           DISPLAY PREDIT LINE 15 POSITION 27
           ACCEPT NADA OFF

           DISPLAY " " ERASE
           DISPLAY "CONSULTAR TABLA" LINE 5 POSITION 30 REVERSE BLINK
           DISPLAY "ARTICULO:" LINE 10 POSITION 15
           ACCEPT I LINE 10 POSITION 25
           PERFORM LEER-I UNTIL I < 5 AND I >= 0.

       LEER-I.
           DISPLAY "ARTICULO:" LINE 10 POSITION 15
           ACCEPT I LINE 10 POSITION 25.
       LEER-J.
           DISPLAY "CALIDAD:" LINE 11 POSITION 15
           ACCEPT J LINE 11 POSITION 25.
       LEER-K.
           DISPLAY "TIPO-VTA:" LINE 12 POSITION 15
           ACCEPT K  LINE 12 POSITION 25.

       CARGAR-ART.
           DISPLAY "ARTICULO:" LINE 10 POSITION 15
           DISPLAY I LINE 10 POSITION 25
           DISPLAY "CALIDAD:" LINE 14 POSITION 15
           DISPLAY J LINE 14 POSITION 25
           DISPLAY "TIPO-VTA:" LINE 18 POSITION 15
           DISPLAY K LINE 18 POSITION 25
           DISPLAY "PRECIO:" REVERSE BLINK LINE 21 POSITION 15
           ACCEPT PRECIO (I, J, K) LINE 21 POSITION 27 UPDATE.

