       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL ALMACEN ASSIGN TO DISK "DATOSALM.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS NUM-REF
           ALTERNATE RECORD KEY IS SENAL-STOK WITH DUPLICATES.
           SELECT LISTADO ASSIGN TO PRINT "PRINTER".
       DATA DIVISION.
       FILE SECTION.
       FD ALMACEN LABEL RECORD STANDARD.
       01 REG-ALM.
           02 NUM-REF PIC 9(5).
           02 DESCRI-ALM PIC X(25).
           02 CANT-ALM PIC 9(6).
           02 MIN-STOK PIC 9(6).
           02 PASTA-ALM PIC 9(6).
           02 FECHA-ALM.
                03 DIA PIC 99.
                03 MES PIC 99.
                03 ANO PIC 99.
           02 SENAL-STOK PIC X.
       FD LISTADO LABEL RECORD OMITTED.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       01 FECHA-SYS.
           02 ANO-SYS PIC 99.
           02 MES-SYS PIC 99.
           02 DIA-SYS PIC 99.
       77 CONT PIC 99.
       77 CONTINUAR PIC X.
       77 NADA PIC X.
       77 CORRECTO PIC 9.
       77 BLANCOS PIC X(76) VALUE " ".
       77 OPCION PIC 9.
       77 CANTIDAD PIC 9(6).
       77 CONTLIN PIC 99 VALUE 0.
       77 CONTPAG PIC 99 VALUE 0.
       01 TECLAS.
           02 TECLA PIC X.
           02 TECLAFUNC PIC 99 COMP.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       01 LUGARESSS.
           02 LUNUM-REF PIC 99 VALUE 03.
           02 LUDESCRI-ALM PIC 99 VALUE 10.
           02 LUCANT-ALM PIC 99 VALUE 37.
           02 LUMIN-STOK PIC 99 VALUE 47.
           02 LUPASTA-ALM PIC 99 VALUE 57.
           02 LUFECHA-ALM PIC 99 VALUE 69.
       01 LIN.
           02 SITIO      PIC 99.
           02 REPETICION PIC 99.
       01 LIN1.
           02 FILLER PIC X(30) VALUE SPACES.
           02 FILLER PIC X(19) VALUE "LISTADO DEL ALMACEN".
       01 LIN2.
           02 FILLER PIC X(28) VALUE SPACES.
           02 FILLER PIC X(23) VALUE ALL "Í".
       01 LIN3.
           02 FILLER PIC X(7) VALUE "NUM-REF".
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(23) VALUE "DESCRICION DEL ARTICULO".
           02 FILLER PIC X(2) VALUE SPACES.
           02 FILLER PIC X(11) VALUE "EXISTENCIAS".
           02 FILLER PIC X(2) VALUE SPACES.
           02 FILLER PIC X(8) VALUE "STOK-MIN".
           02 FILLER PIC X(2) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "P.U.".
           02 FILLER PIC X(2) VALUE SPACES.
           02 FILLER PIC X(18) VALUE "ULTIMA VARIACION".
       01 LIN4.
           02 FILLER PIC X(3)  VALUE SPACES.
           02 FILLER PIC X(45) VALUE ALL "Í".
           02 FILLER PIC X(32) VALUE ALL "Í".
       01 LIN-DET.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-NUM-REF PIC ZZZZ9.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-DESCRI-ALM PIC X(25).
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-CANT-ALM PIC ZZZZZ9.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-MIN-STOK PIC ZZZZZ9.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-PASTA-ALM PIC ZZZZZ9.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-DIA PIC 99.
           02 FILLER PIC X VALUE "-".
           02 L-MES PIC 99.
           02 FILLER PIC X VALUE "-".
           02 L-ANO PIC 99.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-SENAL-STOK PIC X.
       PROCEDURE DIVISION.
       MAIN.
           MOVE "S" TO CONTINUAR
           MOVE 'S' TO CORRECTO
           OPEN I-O ALMACEN
           OPEN OUTPUT LISTADO
           PERFORM PANTALLA
           PERFORM IMPDATOS UNTIL CORRECTO = 'N'
           CLOSE ALMACEN
           CLOSE LISTADO
           EXIT PROGRAM.
       IMPDATOS.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "IMPRIMIENDO" LINE 24 POSITION 65 BLINK
            REVERSE
           IF TECLAFUNC = 2
            MOVE "*" TO SENAL-STOK
            START ALMACEN KEY IS = SENAL-STOK
                INVALID KEY
                    PERFORM ERRO1
                NOT INVALID KEY
                    PERFORM IMPRIMIR
            ELSE
              PERFORM IMPRIMIR
           END-IF.
       ERRO1.
           MOVE 'N' TO CORRECTO
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "NO EXISTE NIGUN ARTICULO CON MIM-STOCK"
            LINE 24 POSITION 5 REVERSE.
       IMPRIMIR.
           PERFORM CABECERAS
           READ ALMACEN NEXT AT END MOVE 'N' TO CORRECTO
           END-READ
           PERFORM LEER UNTIL CORRECTO = 'N'.
       CABECERAS.
           WRITE LINEA FROM LIN1 BEFORE ADVANCING 1
           WRITE LINEA FROM LIN2 BEFORE ADVANCING 2
           WRITE LINEA FROM LIN3 BEFORE ADVANCING 2
           WRITE LINEA FROM LIN4 BEFORE ADVANCING 2.
       LEER.
           IF SENAL-STOK = "*" AND TECLAFUNC = 2
             PERFORM ImprimirListado
            ELSE
             IF TECLAFUNC = 1
              PERFORM ImprimirListado
             END-IF
           END-IF
           READ ALMACEN NEXT AT END MOVE 'N' TO CORRECTO.
       ImprimirListado.
           MOVE NUM-REF    TO L-NUM-REF
           MOVE DESCRI-ALM TO L-DESCRI-ALM
           MOVE CANT-ALM   TO L-CANT-ALM
           MOVE MIN-STOK   TO L-MIN-STOK
           MOVE PASTA-ALM  TO L-PASTA-ALM
           MOVE DIA        TO L-DIA
           MOVE MES        TO L-MES
           MOVE ANO        TO L-ANO
           MOVE SENAL-STOK TO L-SENAL-STOK
           WRITE LINEA FROM LIN-DET BEFORE ADVANCING 1
           ADD 1 TO CONTLIN
           IF CONTLIN = 40
             MOVE 0 TO CONTLIN
             ADD 1 TO CONTPAG
             MOVE CONTPAG TO LINEA
             WRITE LINEA BEFORE PAGE
             PERFORM CABECERAS
           END-IF.

       PANTALLA.
           DISPLAY " " ERASE LINE 2 POSITION 1
           MOVE 02012279 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 23012579 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "F1 LISTADO DEL ALMACEN" LINE 7 POSITION 20
           DISPLAY "F2 LISTADO DE ARTICULOS CON STOK MINIMO"
            LINE 9 POSITION 20
           PERFORM VALIDAR WITH TEST AFTER UNTIL TECLAFUNC = 1 OR 2.
       VALIDAR.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           ACCEPT TECLA LINE 24 POSITION 8 ON EXCEPTION TECLAFUNC
            CONTINUE
           END-ACCEPT.
