       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ALMACEN ASSIGN TO DISK "DATOSALM.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS NUM-REF
           ALTERNATE RECORD KEY IS SENAL-STOK WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD ALMACEN LABEL RECORD STANDARD.
       01 REG-ALM.
           02 NUM-REF PIC 9(5).
           02 DESCRI-ALM PIC X(25).
           02 CANT-ALM PIC 9(6).
           02 MIN-STOK PIC 9(6).
           02 PASTA-ALM PIC 9(6).
           02 FECHA-ALM.
                03 DIA PIC 99.
                03 MES PIC 99.
                03 ANO PIC 99.
           02 SENAL-STOK PIC X.
       WORKING-STORAGE SECTION.
       01 FECHA-SYS.
           02 ANO-SYS PIC 99.
           02 MES-SYS PIC 99.
           02 DIA-SYS PIC 99.
       01 CCCCCCC.
          02 MAXCONT  PIC 99 VALUE 21.
          02 INITCONT PIC 99 VALUE 4.
          02 CONT PIC 99.
       77 CONTINUAR PIC X.
       77 NADA PIC X.
       77 CORRECTO PIC 9.
       77 BLANCOS PIC X(76) VALUE " ".
       77 OPCION PIC 9.
       77 CANTIDAD PIC 9(6).
       01 TECLAS.
           02 TECLA PIC X.
           02 TECLAFUNC PIC 99 COMP.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       01 LUGARESSS.
           02 LUNUM-REF PIC 99 VALUE 03.
           02 LUDESCRI-ALM PIC 99 VALUE 10.
           02 LUCANT-ALM PIC 99 VALUE 37.
           02 LUMIN-STOK PIC 99 VALUE 47.
           02 LUPASTA-ALM PIC 99 VALUE 57.
           02 LUFECHA-ALM PIC 99 VALUE 69.
       01 LIN.
           02 SITIO      PIC 99.
           02 REPETICION PIC 99.
       PROCEDURE DIVISION.
       MAIN.
           MOVE "S" TO CONTINUAR
           MOVE 'S' TO CORRECTO
           OPEN INPUT ALMACEN
           MOVE INITCONT TO CONT
           PERFORM PREGUNTA
           PERFORM CARGAR UNTIL CORRECTO = "N" OR  CONTINUAR = 'N'
           IF CORRECTO = 'N'
                 DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
                 DISPLAY "ULTIMO REGISTRO EN PANTALLA" LINE 24
                    POSITION 40 REVERSE
                  ACCEPT NADA LINE 24 POSITION 4 REVERSE UPDATE
                  END-ACCEPT
           END-IF
           CLOSE ALMACEN
           EXIT PROGRAM.

       LEIDO.
           IF NUM-REF NOT = 0
           ADD 1 TO CONT
           DISPLAY NUM-REF LINE CONT POSITION LUNUM-REF
           DISPLAY DESCRI-ALM LINE CONT POSITION LUDESCRI-ALM
           DISPLAY CANT-ALM LINE CONT POSITION LUCANT-ALM
           DISPLAY MIN-STOK LINE CONT POSITION LUMIN-STOK
           DISPLAY PASTA-ALM LINE CONT POSITION LUPASTA-ALM
           DISPLAY CANT-ALM LINE CONT POSITION LUCANT-ALM
           DISPLAY "  -  -  " LINE CONT POSITION LUFECHA-ALM
           DISPLAY ANO LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM + 3
           DISPLAY MES LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM + 3
           DISPLAY DIA LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM - 6
           END-IF.
       CARGAR.
           IF TECLAFUNC = 2
               MOVE "*" TO SENAL-STOK
               START ALMACEN KEY IS = SENAL-STOK
                    INVALID KEY
                      PERFORM ERRO1
                    NOT INVALID KEY
                       PERFORM PANTALLA
                       PERFORM APANTALLA
            ELSE
              PERFORM PANTALLA
              PERFORM APANTALLA
           END-IF.
       ERRO1.
           MOVE 'N' TO CONTINUAR
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "NO EXISTE NIGUN ARTICULO CON MIM-STOCK"
            LINE 24 POSITION 5 REVERSE
           ACCEPT NADA OFF.
       APANTALLA.
           READ ALMACEN NEXT AT END MOVE 'N' TO CORRECTO
           END-READ
           PERFORM LEER UNTIL CORRECTO = 'N' OR CONTINUAR = 'N'.
       LEER.
           IF CONT = MAXCONT
                           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
                           DISPLAY "DESEA CONTINUAR S/N?" LINE 24
                           POSITION 40 REVERSE
                           ACCEPT CONTINUAR LINE 24 POSITION 61
                           REVERSE UPDATE
                          MOVE INITCONT TO CONT
                          PERFORM PANTALLA
           END-IF
           IF SENAL-STOK = "*" AND TECLAFUNC = 2
             PERFORM LEIDO
            ELSE
             IF TECLAFUNC = 1
              PERFORM LEIDO
             END-IF
           END-IF
           READ ALMACEN NEXT AT END MOVE 'N' TO CORRECTO.
       PREGUNTA.
           DISPLAY " " ERASE LINE 2 POSITION 1
           MOVE 02012279 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 23012579 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "F1 LISTADO DEL ALMACEN" LINE 7 POSITION 20
           DISPLAY "F2 LISTADO DE ARTICULOS CON STOK MINIMO"
            LINE 9 POSITION 20
           PERFORM VALIDAR WITH TEST AFTER UNTIL TECLAFUNC = 1 OR 2.
       VALIDAR.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           ACCEPT TECLA LINE 24 POSITION 8 ON EXCEPTION TECLAFUNC
            CONTINUE
           END-ACCEPT.

       PANTALLA.
           DISPLAY " " ERASE LINE 3 POSITION 1
           MOVE 02012279 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           COMPUTE SITIO = LUDESCRI-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUCANT-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUMIN-STOK - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUPASTA-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUFECHA-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           MOVE 23012579 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "N-REF" LINE 3 POSITION LUNUM-REF
           DISPLAY "DESCRICCION" LINE 3 POSITION LUDESCRI-ALM
           DISPLAY "CANTIDAD" LINE 3 POSITION LUCANT-ALM
           DISPLAY "STOK-MIN" LINE 3 POSITION LUMIN-STOK
           DISPLAY "PRECIO-ART" LINE 3 POSITION LUPASTA-ALM
           DISPLAY "ULT-FECHA" LINE 3 POSITION LUFECHA-ALM
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE.
