       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL ALMACEN ASSIGN TO DISK "DATOSALM.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS NUM-REF
           ALTERNATE RECORD KEY IS SENAL-STOK WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD ALMACEN LABEL RECORD STANDARD.
       01 REG-ALM.
           02 NUM-REF PIC 9(5).
           02 DESCRI-ALM PIC X(25).
           02 CANT-ALM PIC 9(6).
           02 MIN-STOK PIC 9(6).
           02 PASTA-ALM PIC 9(6).
           02 FECHA-ALM.
                03 DIA PIC 99.
                03 MES PIC 99.
                03 ANO PIC 99.
           02 SENAL-STOK PIC X.
       WORKING-STORAGE SECTION.
       01 FECHA-SYS.
           02 ANO-SYS PIC 99.
           02 MES-SYS PIC 99.
           02 DIA-SYS PIC 99.
       01 CCCCCCC.
          02 MAXCONT  PIC 99 VALUE 21.
          02 INITCONT PIC 99 VALUE 4.
          02 CONT PIC 99.
       77 CONTINUAR PIC X.
       77 NADA PIC X.
       77 CORRECTO PIC 9.
       77 BLANCOS PIC X(76) VALUE " ".
       77 OPCION PIC 9.
       77 CANTIDAD PIC 9(6).
       01 TECLAS.
           02 TECLA PIC X.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       01 LUGARESSS.
           02 LUNUM-REF PIC 99 VALUE 03.
           02 LUDESCRI-ALM PIC 99 VALUE 10.
           02 LUCANT-ALM PIC 99 VALUE 37.
           02 LUMIN-STOK PIC 99 VALUE 47.
           02 LUPASTA-ALM PIC 99 VALUE 57.
           02 LUFECHA-ALM PIC 99 VALUE 69.
       01 LIN.
           02 SITIO      PIC 99.
           02 REPETICION PIC 99.
       PROCEDURE DIVISION.
       MAIN.
           MOVE "S" TO CONTINUAR
           MOVE 'N' TO CORRECTO
           OPEN I-O ALMACEN
           MOVE INITCONT TO CONT
           PERFORM PANTALLA
           PERFORM CARGAR UNTIL CONTINUAR = 'N'.
           CLOSE ALMACEN
           EXIT PROGRAM.
       CARGAR.
           PERFORM VALIDAREF WITH TEST AFTER UNTIL CORRECTO = 'S'
            OR CONTINUAR = 'N'
           MOVE 'N' TO CORRECTO
           IF CANT-ALM NOT > MIN-STOK
                MOVE '*' TO SENAL-STOK
              ELSE
                MOVE ' ' TO SENAL-STOK
           END-IF
           PERFORM ESCRIBIR
           IF CONT = MAXCONT
                          MOVE INITCONT TO CONT
                          PERFORM PANTALLA
                        ELSE
                          ADD 1 TO CONT
           END-IF.
       VALIDAREF.
           DISPLAY "     " LINE CONT POSITION LUNUM-REF
           ACCEPT NUM-REF LINE CONT POSITION LUNUM-REF  NO BEEP
           READ ALMACEN INVALID KEY     PERFORM ERRONUM-REF
                        NOT INVALID KEY PERFORM MODIFICAR
           END-READ.
       ERRONUM-REF.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "EL ARTICULO NO EXISTE   (PULSE UNA TECLA)"
           LINE 24 POSITION 3 REVERSE
           ACCEPT NADA OFF
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "DESEA CONTINUAR S/N?" LINE 24 POSITION 40
                 REVERSE
           ACCEPT CONTINUAR LINE 24 POSITION 61  REVERSE UPDATE
           NO BEEP.
       MODIFICAR.
           MOVE 'S' TO CORRECTO
           DISPLAY DESCRI-ALM LINE CONT POSITION LUDESCRI-ALM
           DISPLAY CANT-ALM LINE CONT POSITION LUCANT-ALM
           DISPLAY MIN-STOK LINE CONT POSITION LUMIN-STOK
           DISPLAY PASTA-ALM LINE CONT POSITION LUPASTA-ALM
           DISPLAY "  -  -  " LINE CONT POSITION LUFECHA-ALM
           DISPLAY ANO LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM + 3
           DISPLAY MES LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM + 3
           DISPLAY DIA LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM - 6
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "YA PUEDE MODIFICAR EL FICHERO" LINE 24 POSITION 3
                 REVERSE
           ACCEPT DESCRI-ALM LINE CONT POSITION LUDESCRI-ALM
              NO BEEP UPDATE
           ACCEPT CANT-ALM LINE CONT POSITION LUCANT-ALM
              NO BEEP UPDATE
           ACCEPT MIN-STOK LINE CONT POSITION LUMIN-STOK
              NO BEEP UPDATE
           ACCEPT PASTA-ALM LINE CONT POSITION LUPASTA-ALM
              NO BEEP UPDATE
           ACCEPT FECHA-SYS FROM DATE
           MOVE ANO-SYS TO ANO
           MOVE MES-SYS TO MES
           MOVE DIA-SYS TO DIA
           DISPLAY "  -  -  " LINE CONT POSITION LUFECHA-ALM
           DISPLAY ANO LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM + 3
           DISPLAY MES LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM + 3
           DISPLAY DIA LINE CONT POSITION LUFECHA-ALM
           COMPUTE LUFECHA-ALM = LUFECHA-ALM - 6
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE.
       ESCRIBIR.
           IF CONTINUAR NOT = 'N'
             MOVE 0 TO CORRECTO
             PERFORM GRABA
             DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
             DISPLAY "DESEA CONTINUAR S/N?" LINE 24 POSITION 40
                 REVERSE
             ACCEPT CONTINUAR LINE 24 POSITION 61  REVERSE UPDATE
           END-IF.
       GRABA.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           REWRITE REG-ALM
           INVALID KEY DISPLAY "ERROR AL ESCRIBIR" LINE 24 POSITION 7
           NOT INVALID KEY DISPLAY "GRABACION SATISFACTORIA"
           LINE 24 POSITION 7 REVERSE.
       PANTALLA.
           DISPLAY " " ERASE LINE 3 POSITION 1
           MOVE 02012279 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           COMPUTE SITIO = LUDESCRI-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUCANT-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUMIN-STOK - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUPASTA-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           COMPUTE SITIO = LUFECHA-ALM - 3
           CALL "LINV.COB" USING VENT LIN
           MOVE 23012579 TO CUADRO
           MOVE 14000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "N-REF" LINE 3 POSITION LUNUM-REF
           DISPLAY "DESCRICCION" LINE 3 POSITION LUDESCRI-ALM
           DISPLAY "CANTIDAD" LINE 3 POSITION LUCANT-ALM
           DISPLAY "STOK-MIN" LINE 3 POSITION LUMIN-STOK
           DISPLAY "PRECIO-ART" LINE 3 POSITION LUPASTA-ALM
           DISPLAY "ULT-FECHA" LINE 3 POSITION LUFECHA-ALM
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE.
