       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREACCION.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL MAESTRO ASSIGN TO DISK "MAESTRO.DAT".
           SELECT OPTIONAL MOVI ASSIGN TO DISK "MOVI.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD MAESTRO LABEL RECORD STANDARD.
       01 REGMAE.
           02 NUMAE PIC X(10).
           02 SALDO PIC 9(9).
       FD MOVI LABEL RECORD STANDARD.
       01 REGMOV.
           02 NUMOV PIC X(10).
           02 IMPORTE PIC 9(9).
           02 OPERAC PIC X.
       WORKING-STORAGE SECTION.
       01 VENT.
           02 CUADRADO PIC 9(8).
           02 HELP PIC 9(8).
       01 LIN.
           02 SITIO PIC 99.
           02 REPETICION PIC 99.
       PROCEDURE DIVISION.
       MAIN.
           OPEN EXTEND MAESTRO MOVI
           DISPLAY " " ERASE
           MOVE 00002580 TO CUADRADO
           MOVE 10000000 TO HELP
           MOVE 3 TO SITIO
           CALL "VENTANA.COB" USING VENT
           CALL "LINH.COB" USING VENT LIN
           DISPLAY "CREACION DE FICHERO CLIENTES" LINE 3 POSITION 10
           DISPLAY "NUMERO DE CLIENTE:"  LINE 5 POSITION 5
           DISPLAY "SALDO............:" LINE 8 POSITION 5
           PERFORM CREMAESTRO WITH TEST AFTER UNTIL NUMAE = "*"
           DISPLAY " " ERASE
           MOVE 00002580 TO CUADRADO
           MOVE 10000000 TO HELP
           MOVE 3 TO SITIO
           CALL "VENTANA.COB" USING VENT
           CALL "LINH.COB" USING VENT LIN
           DISPLAY "CREACION DE FICHERO MOVIMIENTOS" LINE 3 POSITION 10
           DISPLAY "NUMERO DE CLIENTE:"  LINE 5 POSITION 5
           DISPLAY "IMPORTE..........:" LINE 8 POSITION 5
           DISPLAY "OPERACION........:" LINE 11 POSITION 5
           PERFORM CREMOVI WITH TEST AFTER UNTIL NUMOV = "*"
           CLOSE MAESTRO MOVI
           STOP RUN.
       CREMAESTRO.
           ACCEPT NUMAE LINE 5 POSITION 26 NO BEEP TAB
           ACCEPT SALDO LINE 8 POSITION 26 NO BEEP TAB
           IF NUMAE NOT = "*"
                 WRITE REGMAE
           END-IF
           DISPLAY "NUMERO DE CLIENTE:     "  LINE 5 POSITION 5
           DISPLAY "SALDO............:             " LINE 8 POSITION 5.
       CREMOVI.
           ACCEPT NUMOV LINE 5 POSITION 26 NO BEEP TAB
           ACCEPT IMPORTE LINE 8 POSITION 26 NO BEEP TAB
           PERFORM VALOPE WITH TEST AFTER UNTIL OPERAC = "I" OR "R".
       VALOPE.
           ACCEPT OPERAC LINE 11 POSITION 26 NO BEEP
           IF NUMOV NOT = "*"
                 WRITE REGMOV
           END-IF
           DISPLAY "NUMERO DE CLIENTE:        "  LINE 5
               POSITION 5
           DISPLAY "IMPORTE..........:         " LINE 8
               POSITION 5
           DISPLAY "OPERACION........:         " LINE 11
               POSITION 5.

