       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJER3.
       AUTHOR. CHICOTE-MARIO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL LIBROS ASSIGN TO DISK "LIBROS.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS NREG
           ALTERNATE RECORD KEY IS APEL1 WITH DUPLICATES
           ALTERNATE RECORD KEY IS APEL2 WITH DUPLICATES
           ALTERNATE RECORD KEY IS NOM WITH DUPLICATES
           ALTERNATE RECORD KEY IS TITULO WITH DUPLICATES
           ALTERNATE RECORD KEY IS EDIT WITH DUPLICATES
           ALTERNATE RECORD KEY IS ANEDIT WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD LIBROS LABEL RECORD STANDARD.
       01 REG-LIB.
           02 NREG PIC X(6).
           02 AUTOR.
              03 APEL1 PIC X(10).
              03 APEL2 PIC X(10).
              03 NOM PIC X(10).
           02 TITULO PIC X(40).
           02 EDIT PIC X(15).
           02 ANEDIT PIC 9(4).
           02 NUMPAG PIC 9(4).
           02 PVP PIC 9(5).
           02 EXIST PIC 99.
       WORKING-STORAGE SECTION.
       77 CONTINUAR PIC X.
       77 VENT PIC 9(16).
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY  " " ERASE
           MOVE  0000248011000000 TO VENT
           CALL "VENTANA.COB" USING VENT
           OPEN I-O LIBROS
           MOVE "S" TO CONTINUAR
           PERFORM ALTAS UNTIL CONTINUAR = "N" OR CONTINUAR = "n"
           CLOSE LIBROS
           DISPLAY " " ERASE
           EXIT PROGRAM.
       ALTAS.
           DISPLAY "NUM. REGISTRO:           " LINE 3 POSITION 5
           DISPLAY "AUTOR" LINE 5 POSITION 5
           DISPLAY "APELLIDO 1§:             APELLIDO 2§:           "
              LINE 7 POSITION 5
           DISPLAY "NOMBRE:                " LINE 7 POSITION 57
           DISPLAY "TITULO:                                         "
              LINE 9 POSITION 5
           DISPLAY "EDITORIAL:                  " LINE 11 POSITION 5
           DISPLAY "A¥O DE EDICION:      " LINE 13 POSITION 5
           DISPLAY "NUM. PAGINAS:        " LINE 15 POSITION 5
           DISPLAY "PRECIO:           " LINE 17 POSITION 5
           DISPLAY "EXISTENCIAS:      " LINE 19 POSITION 5
           DISPLAY "                        " LINE 23 POSITION 5
           DISPLAY "                        " LINE 23 POSITION 29
           ACCEPT NREG LINE 3 POSITION 20 TAB
           ACCEPT APEL1 LINE 7 POSITION 18 TAB
           ACCEPT APEL2 LINE 7 POSITION 43 TAB
           ACCEPT NOM LINE 7 POSITION 65 TAB
           ACCEPT TITULO LINE 9 POSITION 13 TAB
           ACCEPT EDIT LINE 11 POSITION 16 TAB
           ACCEPT ANEDIT LINE 13 POSITION 21 TAB
           ACCEPT NUMPAG LINE 15 POSITION 19 TAB
           ACCEPT PVP LINE 17 POSITION 13 TAB
           ACCEPT EXIST LINE 19 POSITION 18 TAB
           WRITE REG-LIB INVALID KEY DISPLAY "ERROR EN LA GRABACION   "
             LINE 23 POSITION 5  NOT INVALID KEY DISPLAY
             "GRABACION SATISFACTORIA" LINE 23 POSITION 5.
           DISPLAY "¨DESEA CONTINUAR S/N? S" LINE 23 POSITION 30
           ACCEPT CONTINUAR LINE 23 POSITION 52.
           







