       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJER3.
       AUTHOR. CHICOTE-MARIO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT LIBROS ASSIGN TO DISK "LIBROS.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS NREG
           ALTERNATE RECORD KEY IS APEL1 WITH DUPLICATES
           ALTERNATE RECORD KEY IS APEL2 WITH DUPLICATES
           ALTERNATE RECORD KEY IS NOM WITH DUPLICATES
           ALTERNATE RECORD KEY IS TITULO WITH DUPLICATES
           ALTERNATE RECORD KEY IS EDIT WITH DUPLICATES
           ALTERNATE RECORD KEY IS ANEDIT WITH DUPLICATES.
           SELECT LISTADO ASSIGN TO PRINT "PRINTER".
       DATA DIVISION.
       FILE SECTION.
       FD LIBROS LABEL RECORD STANDARD.
       01 REG-LIB.
           02 NREG PIC X(6).
           02 AUTOR.
              03 APEL1 PIC X(10).
              03 APEL2 PIC X(10).
              03 NOM PIC X(10).
           02 TITULO PIC X(40).
           02 EDIT PIC X(15).
           02 ANEDIT PIC 9(4).
           02 NUMPAG PIC 9(4).
           02 PVP PIC 9(5).
           02 EXIST PIC 99.
       FD LISTADO LABEL RECORD OMITTED.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       77 BLANCOS PIC X(76) VALUE " ".
       77 NADA PIC X.
       77 ANI PIC 9(4).
       77 ANF PIC 9(4).
       77 T PIC 9(5).
       77 FIN PIC X.
       77 CONTPAG PIC 9 VALUE 1.
       77 CONTLIN PIC 99 VALUE 0.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       01 LIN1.
           02 FILLER PIC X(1) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "NOMBRE".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(11) VALUE "APELLIDO 1§".
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "TITULO".
           02 FILLER PIC X(35) VALUE SPACES.
           02 FILLER PIC X(11) VALUE "A¥O EDICION".
       01 LIN2.
           02 FILLER PIC X(1) VALUE SPACES.
           02 L-NOM PIC X(10).
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-APEL1 PIC X(10).
           02 FILLER PIC X(4) VALUE SPACES.
           02 L-TITULO PIC X(40).
           02 FILLER PIC X(7) VALUE SPACES.
           02 L-ANEDIT PIC 9(4).
       PROCEDURE DIVISION.
       MAIN.
           MOVE "N" TO FIN
           DISPLAY " " ERASE
           MOVE 08251555 TO CUADRO
           MOVE 12000001 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "LISTADO BIBLIOTECA" LINE 8 POSITION 32
           OPEN INPUT LIBROS
           OPEN OUTPUT LISTADO
           PERFORM VISUAL
           PERFORM 1VALIDA WITH TEST AFTER UNTIL ANI NOT > ANF
           MOVE ANI TO ANEDIT
           PERFORM TIEMPO UNTIL FIN = "S"
           CLOSE LIBROS LISTADO
           DISPLAY " " ERASE
           EXIT PROGRAM.
       VISUAL.
           DISPLAY "A¥O-INICIO:     " LINE 11 POSITION 30
           DISPLAY "A¥O-FINAL.:     " LINE 13 POSITION 30.
       1VALIDA.
           ACCEPT ANI LINE 11 POSITION 42 END-ACCEPT
           ACCEPT ANF LINE 13 POSITION 42 END-ACCEPT
           IF ANI > ANF
                  DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
                  DISPLAY "LA F.INICIAL DEBE SER MAYOR QUE LA F.FINAL"
                   LINE 24 POSITION 7
                  ACCEPT NADA
                  DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           END-IF.
           ACCEPT NADA.
       TIEMPO.
           START LIBROS KEY IS NOT < ANEDIT
                INVALID KEY DISPLAY "ERROR" LINE 23 POSITION 5
                NOT INVALID KEY
                READ LIBROS NEXT AT END MOVE "S" TO FIN
                END-READ
           END-START.
           PERFORM MOSTRAR UNTIL FIN = "S".
       MOSTRAR.
           IF CONTLIN = 40 OR CONTPAG = 1
               IF CONTPAG NOT = 1 WRITE LINEA BEFORE PAGE END-IF
               MOVE 0 TO CONTLIN
               ADD 1 TO CONTPAG
               WRITE LINEA FROM LIN1 BEFORE 3
           END-IF.
           MOVE NOM TO L-NOM
           MOVE APEL1 TO L-APEL1
           MOVE TITULO TO L-TITULO
           MOVE ANEDIT TO L-ANEDIT
           WRITE LINEA FROM LIN2 BEFORE 1
           ADD 1 TO CONTLIN
           READ LIBROS NEXT AT END MOVE "S" TO FIN
           END-READ.
           IF ANEDIT > ANF MOVE "S" TO FIN END-IF.