       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJER3.
       AUTHOR. CHICOTE-MARIO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT LIBROS ASSIGN TO DISK "LIBROS.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS NREG
           ALTERNATE RECORD KEY IS APEL1 WITH DUPLICATES
           ALTERNATE RECORD KEY IS APEL2 WITH DUPLICATES
           ALTERNATE RECORD KEY IS NOM WITH DUPLICATES
           ALTERNATE RECORD KEY IS TITULO WITH DUPLICATES
           ALTERNATE RECORD KEY IS EDIT WITH DUPLICATES
           ALTERNATE RECORD KEY IS ANEDIT WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD LIBROS LABEL RECORD STANDARD.
       01 REG-LIB.
           02 NREG PIC X(6).
           02 AUTOR.
              03 APEL1 PIC X(10).
              03 APEL2 PIC X(10).
              03 NOM PIC X(10).
           02 TITULO PIC X(40).
           02 EDIT PIC X(15).
           02 ANEDIT PIC 9(4).
           02 NUMPAG PIC 9(4).
           02 PVP PIC 9(5).
           02 EXIST PIC 99.
       WORKING-STORAGE SECTION.
       77 BLANCOS PIC X(76) VALUE " ".
       77 NADA PIC X.
       77 CONTINUAR PIC X.
       77 FIN PIC X.
       77 CONT PIC 9.
       77 ANI PIC 9(4).
       77 ANF PIC 9(4).
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       LINKAGE SECTION.
       77 MODO PIC 9.
       PROCEDURE DIVISION USING MODO.
       MAIN.
           MOVE "S" TO CONTINUAR
           MOVE 0 TO CONT
           DISPLAY " " ERASE
           MOVE 01010379 TO CUADRO
           MOVE 10000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 04012279 TO CUADRO
           CALL "VENTANA.COB" USING VENT
           MOVE 23012579 TO CUADRO
           MOVE 12000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "LISTADO BIBLIOTECA" LINE 2 POSITION 3
           PERFORM VISUAL UNTIL CONTINUAR = "N" OR "n".
           DISPLAY " " ERASE
           EXIT PROGRAM.
       VISUAL.
           DISPLAY "A¥O-INICIO:    " LINE 3 POSITION 5
           DISPLAY "A¥O-FINAL.:    " LINE 3 POSITION 32
           DISPLAY "ISBN:      " LINE 11 POSITION   37
           DISPLAY "AUTOR" LINE 5 POSITION 5
           DISPLAY "APELLIDO 1§:             APELLIDO 2§:           "
              LINE 7 POSITION 5
           DISPLAY "NOMBRE:               " LINE 7 POSITION 57
           DISPLAY "TITULO:                                         "
              LINE 9 POSITION 5
           DISPLAY "EDITORIAL:                  " LINE 11 POSITION 5
           DISPLAY "A¥O DE EDICION:      " LINE 13 POSITION 5
           DISPLAY "NUM. PAGINAS:        " LINE 15 POSITION 5
           DISPLAY "PRECIO:           " LINE 17 POSITION 5
           DISPLAY "EXISTENCIAS:      " LINE 19 POSITION 5
           PERFORM 1VALIDA WITH TEST AFTER UNTIL ANI NOT > ANF
           MOVE "N" TO FIN
           MOVE 0 TO CONT
           OPEN INPUT LIBROS
           MOVE "S" TO CONTINUAR
           PERFORM LECTURA UNTIL FIN = "S" OR CONTINUAR = "N"
           IF CONT = 0
               PERFORM ERROR1
           END-IF.
           CLOSE LIBROS.
       1VALIDA.
           ACCEPT ANI LINE 3 POSITION 16
           ACCEPT ANF LINE 3 POSITION 43
           IF ANI > ANF
                  DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
                  DISPLAY " MAJICO MENUDO ERRORCITO" LINE 24
                    POSITION 7
                  ACCEPT NADA
                  DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           END-IF.
       LECTURA.
           READ LIBROS AT END MOVE "S" TO FIN
           END-READ.
           IF ANEDIT NOT < ANI AND NOT > ANF
                 PERFORM MOSTRAR
                 ADD 1 TO CONT
           END-IF.
       MOSTRAR.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY APEL1 LINE 7 POSITION 18
           DISPLAY APEL2 LINE 7 POSITION 43
           DISPLAY NOM LINE 7 POSITION 65
           DISPLAY TITULO LINE 9 POSITION 13
           DISPLAY EDIT LINE 11 POSITION 16
           DISPLAY NREG LINE 11 POSITION 44
           DISPLAY ANEDIT LINE 13 POSITION 21
           DISPLAY NUMPAG LINE 15 POSITION 19
           DISPLAY PVP LINE 17 POSITION 14
           DISPLAY EXIST LINE 19 POSITION 18
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "DESEA CONTINUAR S/N?" LINE 24 POSITION 40
                 REVERSE
           ACCEPT CONTINUAR LINE 24 POSITION 61 REVERSE UPDATE
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE.
       ERROR1.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY " NO HAY DATOS" LINE 24 POSITION 10 REVERSE
           DISPLAY "DESEA CONTINUAR S/N?" LINE 24 POSITION 40
                 REVERSE
           ACCEPT CONTINUAR LINE 24 POSITION 61 REVERSE UPDATE.
