       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ALUMNO ASSIGN TO RANDOM "ALUMNOS.DAT"
           ORGANIZATION IS RELATIVE
           ACCESS MODE IS RANDOM
           RELATIVE KEY IS NUM-AL.
       DATA DIVISION.
       FILE SECTION.
       FD ALUMNO LABEL RECORD STANDARD.
       01 REG-ALUM.
           02 NOM-AL PIC X(10).
           02 APELLIDO-AL PIC X(15).
           02 SEXO-AL PIC X.
               88 VARON VALUE "V".
               88 HEMBRA VALUE "H".
           02 DATOS-CURSO.
               03 CURSO PIC 9.
               03 GRUPO PIC X.
           02 NOTAS PIC 99 OCCURS 5.
       WORKING-STORAGE SECTION.
       77 SALIR PIC 9.
       77 NUM-AL PIC 9(3).
       77 CONTINUAR PIC X VALUE 'S'.
       77 EXISTIR PIC 9.
       77 BLANCOS PIC X(77) VALUE " ".
       77 CONT PIC 9 VALUE 0.
       77 CUADRO PIC 9(8).
       77 HELP PIC 9(8).
       PROCEDURE DIVISION.
       MAIN.
           OPEN I-O ALUMNO.
           PERFORM CARGAR UNTIL CONTINUAR = 'N'.
           CLOSE ALUMNO.
           EXIT PROGRAM.
       CARGAR.
           DISPLAY " " ERASE
           MOVE 01010379 TO CUADRO
           CALL "VENTANA.COB" USING CUADRO , HELP
           MOVE 04012079 TO CUADRO
           CALL "VENTANA.COB" USING CUADRO , HELP
           DISPLAY "ALUMNOS" LINE 2 POSITION 3
           DISPLAY "ALTAS" LINE 2 POSITION 40
           DISPLAY "ALUMNO....:" LINE 8 POSITION 3
           DISPLAY "NOMBRE....:" LINE 11 POSITION 3
           DISPLAY "APELLIDOS.:" LINE 14 POSITION 3
           DISPLAY "CURSO.....:" LINE 17 POSITION 3
           DISPLAY "GRUPO.....:" LINE 17 POSITION 50
           DISPLAY "SEXO......:" LINE 14 POSITION 50
           MOVE 22012479 TO CUADRO
           MOVE 02000000 TO HELP
           CALL "VENTANA.COB" USING CUADRO , HELP
           DISPLAY BLANCOS LINE 23 POSITION 2 REVERSE
           MOVE 0 TO EXISTIR
           PERFORM 1VALIDA UNTIL EXISTIR = 1 OR SALIR = 1
           IF SALIR NOT = 1
              DISPLAY BLANCOS LINE 23 POSITION 1  REVERSE
              DISPLAY " DATOS PARA GRABAR" LINE 23 POSITION 9 REVERSE
              ACCEPT NOM-AL LINE 11 POSITION 16 TAB NO BEEP
              ACCEPT APELLIDO-AL LINE 14 POSITION 16 TAB NO BEEP
              PERFORM 2VALIDA WITH TEST AFTER UNTIL CURSO < 6 AND > 0
              PERFORM 4VALIDA WITH TEST AFTER UNTIL VARON OR HEMBRA
              PERFORM 3VALIDA WITH TEST AFTER UNTIL GRUPO = 'A'
                   OR 'B' OR 'C'
              PERFORM GRABA
              DISPLAY "DESEA CONTINUAR S/N?" LINE 23 POSITION 40
                 REVERSE
              ACCEPT CONTINUAR LINE 23 POSITION 61.
       4VALIDA.
           ACCEPT SEXO-AL LINE 14 POSITION 62 TAB NO BEEP.
       1VALIDA.
           PERFORM 5VALIDA WITH TEST AFTER UNTIL NUM-AL < 550 AND
                NOT < 0.
           IF NUM-AL = 0
                 MOVE 1 TO SALIR
                 MOVE "N" TO CONTINUAR
              ELSE
                 READ ALUMNO INVALID KEY MOVE 1 TO EXISTIR
                     NOT INVALID KEY MOVE 0 TO EXISTIR
                 DISPLAY BLANCOS LINE 23 POSITION 1 REVERSE
                 DISPLAY "NO PUEDE DAR DE ALTA UN ALUMNO YA EXISTENTE"
                     LINE 23 POSITION 9 REVERSE.
       5VALIDA.
           DISPLAY  " 0   --> SALIR" LINE 23 POSITION 55 REVERSE.
           ACCEPT NUM-AL LINE 8 POSITION 16 UPDATE TAB NO BEEP.
       2VALIDA.
           ACCEPT CURSO LINE 17 POSITION 16 TAB NO BEEP.
       3VALIDA.
           ACCEPT GRUPO LINE 17 POSITION 62 TAB NO BEEP.
       GRABA.
           WRITE REG-ALUM.

