       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 TECLA1 PIC 99 COMP.
       77 TECLA PIC 99.
       77 CUADRO PIC 9(8).
       77 HELP PIC 9(8).
       PROCEDURE DIVISION.
       MAIN.
           PERFORM MEN WITH TEST AFTER UNTIL TECLA1 = 27.
           STOP RUN.
       MEN.
           DISPLAY " " ERASE
           MOVE 01010379 TO CUADRO
           CALL "VENTANA.COB" USING CUADRO , HELP
           DISPLAY "FICHERO ALUMNOS" LINE 2 POSITION 31
           MOVE 04012179 TO CUADRO
           CALL "VENTANA.COB" USING CUADRO , HELP
           DISPLAY " ESC: SALIR" LINE 6 POSITION 10
           DISPLAY " F1: CREACCION Y ALTAS" LINE 10 POSITION 10
           DISPLAY " F2: LISTADO POR IMPRESORA" LINE 14 POSITION 10
           DISPLAY " F3: EVALUACION" LINE 18 POSITION 10
           MOVE 22012479 TO CUADRO
           CALL "VENTANA.COB" USING CUADRO , HELP
           DISPLAY " INTRODUZCA LA OPCION DESEADA" LINE 23 POSITION 10
           MOVE  0 TO TECLA1
           MOVE  0 TO TECLA
           ACCEPT TECLA LINE 23 POSITION 50 ON EXCEPTION TECLA1
           EVALUATE TECLA1
               WHEN 1 CALL "5CREA.COB"
               WHEN 2 CALL "5LISTADO.COB"
               WHEN 3 CALL "5NOTAS.COB"
               WHEN 27 CONTINUE
               WHEN OTHER DISPLAY "OPCION ERRONEA" LINE 23 POSITION 60
           END-EVALUATE
           END-ACCEPT.


