       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL ALUMNO ASSIGN TO RANDOM "ALUMNOS.DAT"
           ORGANIZATION IS RELATIVE
           ACCESS MODE IS DYNAMIC
           RELATIVE KEY IS NUM-AL.
       DATA DIVISION.
       FILE SECTION.
       FD ALUMNO LABEL RECORD STANDARD.
       01 REG-ALUM.
           02 NOM-AL PIC X(10).
           02 APELLIDO-AL PIC X(15).
           02 SEXO-AL PIC X.
               88 VARON VALUE "V".
               88 HEMBRA VALUE "H".
           02 DATOS-CURSO.
               03 CURSO PIC 9.
               03 GRUPO PIC X.
           02 NOTAS PIC 99 OCCURS 5.
       WORKING-STORAGE SECTION.
       77 NUM-AL PIC 9(3).
       77 NADA PIC X.
       01 CUADRADO.
           02 TOPL  PIC 99.
           02 TOPP  PIC 99.
           02 DOWNL PIC 99.
           02 DOWNP PIC 99.
       01 HELP.
           02 TIPO PIC 99.
           02 ANCHO PIC 99.
           02 ALTO PIC 99.
           02 SOMBRA PIC 99.
       PROCEDURE DIVISION.
       MAIN.
           OPEN I-O ALUMNO
           PERFORM VISUAL
           CLOSE ALUMNO
           EXIT PROGRAM.
       VISUAL.
           DISPLAY " " ERASE
           MOVE 01010000 TO CUADRADO
           MOVE 00790300 TO HELP
           CALL "VENTANA.COB" USING CUADRADO HELP
           MOVE 05010000 TO CUADRADO
           MOVE 01781701 TO HELP
           CALL "VENTANA.COB" USING CUADRADO HELP
           DISPLAY "ALUMNOS" LINE 2 POSITION 3
           DISPLAY "INTRODUCIR NOTAS " LINE 2 POSITION 30
           DISPLAY "ALUMNO:" LINE 5 POSITION 3
           DISPLAY "APELLIDOS:                    NOMBRE:"
                    LINE 8 POSITION 3
           DISPLAY "SEXO:             CURSO:             GRUPO:"
                   LINE 11 POSITION 3
           PERFORM LEER VARYING NUM-AL FROM 1 BY 1 UNTIL NUM-AL = 551
           DISPLAY "NO SE ENCUENTRAN MAS REGISTROS EN EL FICHERO"
                   LINE 23 POSITION 3
           ACCEPT NADA.
       LEER.
           READ ALUMNO INVALID KEY CONTINUE
             NOT INVALID KEY PERFORM TABLA.
       TABLA.
           DISPLAY NUM-AL LINE 5 POSITION 13
           DISPLAY APELLIDO-AL LINE 8 POSITION 14
           DISPLAY NOM-AL LINE 8 POSITION 41
           DISPLAY SEXO-AL LINE 11 POSITION 9
           DISPLAY CURSO LINE 11 POSITION 28
           DISPLAY GRUPO LINE 11 POSITION 47
           DISPLAY "PRACTICAS      RPG        OSI       TELEINF" LINE
                    15 POSITION 20
           DISPLAY "                                           " LINE
                    18 POSITION 20
           ACCEPT NOTAS(1) LINE 18 POSITION 27
           ACCEPT NOTAS(2) LINE 18 POSITION 36
           ACCEPT NOTAS(3) LINE 18 POSITION 47
           ACCEPT NOTAS(4) LINE 18 POSITION 61
           REWRITE REG-ALUM.
