       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL DISCOS ASSIGN TO DISK "DISCOS.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS NUM-DIS
           ALTERNATE RECORD KEY IS CASA-DIS WITH DUPLICATES.
           SELECT LISTADO ASSIGN TO PRINT "PRINTER".
       DATA DIVISION.
       FILE SECTION.
       FD DISCOS LABEL RECORD STANDARD.
       01 REG-DIS.
           02 NUM-DIS PIC 9(3).
           02 CASA-DIS PIC X(10).
           02 NOM-DIS PIC X(15).
           02 AUTOR-DIS PIC X(15).
           02 FECHA-DIS.
                03 DIA PIC 99.
                03 MES PIC 99.
                03 ANO PIC 9(4).
           02 SOPORTE PIC 9(3).
       FD LISTADO LABEL RECORD OMITTED.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       77 CASA PIC X(10).
       77 EXISTIR PIC 9.
       77 CONTLIN PIC 99 VALUE 0.
       77 CONTPAG PIC 99 VALUE 1.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       01 LIN1.
           02 FILLER PIC X(33) VALUE SPACES.
           02 FILLER PIC X(14) VALUE "LISTADO DISCOS".
       01 LIN2.
           02 FILLER PIC X(33) VALUE SPACES.
           02 FILLER PIC X(16) VALUE "ออออออออออออออออ".
       01  LIN3.
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(12) VALUE "NUMERO DISCO".
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(12) VALUE "NOMBRE DISCO".
           02 FILLER PIC X(6) VALUE SPACES.
           02 FILLER PIC X(5) VALUE "AUTOR".
           02 FILLER PIC X(14) VALUE SPACES.
           02 FILLER PIC X(5) VALUE "FECHA".
           02 FILLER PIC X(9) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "SOPORTE".
       01 LIN5.
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(32) VALUE "ออออออออออออออออออออออออออออออออ".
           02 FILLER PIC X(32) VALUE "ออออออออออออออออออออออออออออออออ".
       01 LIN-DET.
           02 FILLER PIC X(12) VALUE SPACES.
           02 L-NUMDIS PIC ZZ9.
           02 FILLER PIC X(3) VALUE SPACES.
           02 L-NOMDIS PIC X(15).
           02 FILLER PIC X(5) VALUE SPACES.
           02 L-AUTOR PIC X(15).
           02 FILLER PIC X(5) VALUE SPACES.
           02 L-DIA PIC Z9.
           02 FILLER PIC X VALUE "/".
           02 L-MES PIC Z9.
           02 FILLER PIC X VALUE "/".
           02 L-ANO PIC ZZZ9.
           02 FILLER PIC X(6) VALUE SPACES.
           02 L-SOPORTE PIC 999.
       77 CONTINUAR PIC X.
       77 BLANCOS PIC X(77) VALUE " ".
       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT DISCOS.
           OPEN OUTPUT LISTADO.
           PERFORM DATOS WITH TEST AFTER  UNTIL CONTINUAR = "N".
           CLOSE DISCOS.
           EXIT PROGRAM.
       DATOS.
           MOVE 08021577 TO CUADRO
           MOVE 00000001 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "LISTADO DISCOS" LINE 11 POSITION 6
           DISPLAY "CASA DISCOGRAFICA:" LINE 11 POSITION 40
           ACCEPT CASA LINE 11 POSITION 59 TAB
           MOVE CASA TO CASA-DIS
           START DISCOS KEY IS = CASA-DIS INVALID KEY DISPLAY BLANCOS
                    LINE 24 POSITION  3 REVERSE
                    DISPLAY "CASA INEXISTENTE" LINE 24 POSITION 7
                 NOT INVALID KEY PERFORM IMPRIMIR
           PERFORM VALCONTINU WITH TEST AFTER UNTIL
           CONTINUAR = "N" OR "S".
       VALCONTINU.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE.
           DISPLAY "จCONTINUAR?" LINE 24 POSITION 7 REVERSE
           ACCEPT CONTINUAR LINE 24 POSITION 23 REVERSE.
       IMPRIMIR.
           PERFORM CABECERAS
           MOVE 1 TO EXISTIR
           PERFORM LEER UNTIL EXISTIR = 0.
       CABECERAS.
           WRITE LINEA FROM LIN1 BEFORE ADVANCING 1
           WRITE LINEA FROM LIN2 BEFORE ADVANCING 2
           WRITE LINEA FROM LIN3 BEFORE ADVANCING 2
           WRITE LINEA FROM LIN5 BEFORE ADVANCING 2.
       LEER.
           READ DISCOS NEXT AT END
              MOVE 0 TO EXISTIR.
           IF EXISTIR = 1 AND CASA-DIS = CASA
               PERFORM ImprimirListado
             ELSE
               MOVE 0 TO EXISTIR
           END-IF.
       ImprimirListado.
           MOVE  NUM-DIS TO L-NUMDIS
           MOVE  NOM-DIS TO L-NOMDIS
           MOVE AUTOR-DIS TO L-AUTOR
           MOVE DIA TO L-DIA
           MOVE MES TO L-MES
           MOVE ANO TO L-ANO
           MOVE SOPORTE TO L-SOPORTE
           WRITE LINEA FROM LIN-DET BEFORE ADVANCING 1
           ADD 1 TO CONTLIN
           IF CONTLIN = 4
             MOVE 0 TO CONTLIN
             ADD 1 TO CONTPAG
             MOVE SPACES TO LINEA
             WRITE LINEA BEFORE PAGE
             PERFORM CABECERAS.


