       IDENTIFICATION DIVISION.
       PROGRAM-ID. 6PROGRM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 TECLA1 PIC 99 COMP.
       77 TECLA PIC 99.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       PROCEDURE DIVISION.
       MAIN.
           PERFORM MEN WITH TEST AFTER UNTIL TECLA1 = 27.
           STOP RUN.
       MEN.
           DISPLAY " " ERASE
           MOVE 01010379 TO CUADRO
           MOVE 10000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "FICHERO ALUMNOS" LINE 2 POSITION 31
           MOVE 04012179 TO CUADRO
           CALL "VENTANA.COB" USING VENT
           DISPLAY " ESC: SALIR" LINE 6 POSITION 10
           DISPLAY " F1: CREACCION Y ALTAS" LINE 10 POSITION 10
           DISPLAY " F2: BAJAS" LINE 14 POSITION 10
           DISPLAY " F3: MODIFICACIONES" LINE 18 POSITION 10
           MOVE 23002580 TO CUADRO
           MOVE 13000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY " INTRODUZCA LA OPCION DESEADA" LINE 24 POSITION 10
           MOVE  0 TO TECLA1
           MOVE  0 TO TECLA
           ACCEPT TECLA LINE 24 POSITION 50 ON EXCEPTION TECLA1
           EVALUATE TECLA1
               WHEN 1 CALL "6CREA.COB"
               WHEN 2 CALL "6BAJAS.COB"
               WHEN 3 CALL "6MODIF.COB"
               WHEN 4 CALL "6LISTADO.COB"
               WHEN 27 CONTINUE
               WHEN OTHER DISPLAY "OPCION ERRONEA" LINE 23 POSITION 60
           END-EVALUATE
           END-ACCEPT.


