       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENDA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PHILIPS.
       OBJECT-COMPUTER. PHILIPS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL DISCOS ASSIGN TO DISK "DISCOS.DAT"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS NUM-DIS
           ALTERNATE RECORD KEY IS CASA-DIS WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD DISCOS LABEL RECORD STANDARD.
       01 REG-DIS.
           02 NUM-DIS PIC 9(3).
           02 CASA-DIS PIC X(10).
           02 NOM-DIS PIC X(15).
           02 AUTOR-DIS PIC X(15).
           02 FECHA-DIS.
                03 DIA PIC 99.
                03 MES PIC 99.
                03 ANO PIC 9(4).
           02 SOPORTE PIC 9 OCCURS 3.
       WORKING-STORAGE SECTION.
       77 CONTINUAR PIC X.
       77 NADA PIC X.
       77 EXISTIR PIC 9.
       77 BLANCOS PIC X(76) VALUE " ".
       77 CONT PIC 9(3) VALUE 1.
       77 OPCION PIC 9.
       01 VENT.
           02 CUADRO PIC 9(8).
           02 HELP PIC 9(8).
       PROCEDURE DIVISION.
       MAIN.
           MOVE "S" TO CONTINUAR
           OPEN I-O DISCOS
           MOVE 0 TO CONT
           PERFORM MODIFICAR UNTIL CONTINUAR = "N" OR "n".
           CLOSE DISCOS
           EXIT PROGRAM.
       MODIFICAR.
           DISPLAY " " ERASE
           MOVE 01010379 TO CUADRO
           MOVE 10000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           MOVE 04012279 TO CUADRO
           CALL "VENTANA.COB" USING VENT
           MOVE 23012579 TO CUADRO
           MOVE 12000000 TO HELP
           CALL "VENTANA.COB" USING VENT
           DISPLAY "DISCOS" LINE 2 POSITION 3
           DISPLAY "COMPRAS" LINE 2 POSITION 40
           DISPLAY "DISCO NUMERO:" LINE 4 POSITION 3
           MOVE 0 TO EXISTIR
           PERFORM 1VALIDA WITH TEST AFTER UNTIL EXISTIR = 1
           DISPLAY "CASA DISCOGRAFICA....:" LINE 8 POSITION 3
           DISPLAY "TITULO DISCO.........:" LINE 11 POSITION 3
           DISPLAY "AUTHOR...............:" LINE 14 POSITION 3
           DISPLAY "FECHA:" LINE 17 POSITION 3
           DISPLAY "(1: CASSETE)" LINE 19 POSITION 10
           DISPLAY "(2: DISCO)" LINE 19 POSITION 23
           DISPLAY "(3: COMPACT-DISC)" LINE 19 POSITION 35
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "DATOS PARA GRABAR" LINE 24 POSITION 9 REVERSE
           ACCEPT CASA-DIS LINE 8 POSITION 27 TAB NO BEEP PROMPT
              UPDATE REVERSE
           ACCEPT NOM-DIS LINE 11 POSITION 27 TAB NO BEEP REVERSE
             PROMPT UPDATE
           ACCEPT AUTOR-DIS LINE 14 POSITION 27 TAB NO BEEP REVERSE
              UPDATE PROMPT
           MOVE 16030000 TO CUADRO
           CALL "FECHAS.COB" USING FECHA-DIS VENT
           PERFORM 2VALIDA WITH TEST AFTER UNTIL OPCION = "1"
                   OR "2" OR "3"
           MOVE 1 TO SOPORTE(OPCION)
           PERFORM GRABA
           DISPLAY "DESEA CONTINUAR S/N?" LINE 24 POSITION 40
                 REVERSE
           ACCEPT CONTINUAR LINE 24 POSITION 61 REVERSE.
       1VALIDA.
           DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
           DISPLAY "DAME EL NUMERO DE DISCO A MODIFICAR"
              LINE 24 POSITION 7 REVERSE
           ACCEPT NUM-DIS LINE 4 POSITION 20
           READ DISCOS INVALID KEY MOVE 0 TO EXISTIR
                      DISPLAY BLANCOS LINE 24 POSITION 3 REVERSE
                      DISPLAY "NUMERO DE DISCO INEXISTENTE"
                         LINE 24 POSITION 7 REVERSE
                      ACCEPT NADA OFF
                 NOT INVALID KEY MOVE 1 TO EXISTIR.
       2VALIDA.
           ACCEPT OPCION LINE 20 POSITION 13 TAB NO BEEP UPDATE.
       GRABA.
           REWRITE REG-DIS
           INVALID KEY DISPLAY "ERROR AL ESCRIBIR" LINE 24 POSITION 7
           NOT INVALID KEY DISPLAY "GRABACION SATISFACTORIA"
           LINE 24 POSITION 7 REVERSE
           ACCEPT NADA OFF.

