       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJER1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM400.
       OBJECT-COMPUTER. IBM400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT COMPRAS ASSIGN TO DISK "COMPRAS.DAT"
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD COMPRAS LABEL RECORD STANDARD.
       01 REG-COMP.
           02 CODPROV PIC X(4).
           02 FFECHA.
              03 DIA PIC 99.
              03 MES PIC 99.
           02 FTOTALC PIC 9(5).
       WORKING-STORAGE SECTION.
       77 VENT PIC 9(16).
       77 TECLA PIC 99 COMP.
       PROCEDURE DIVISION.
       MAIN.
           OPEN OUTPUT COMPRAS.
           DISPLAY " " ERASE
           MOVE 0000248011000000 TO VENT
           CALL "VENTANA.COB" USING VENT
           PERFORM CREAC UNTIL TECLA = 27
           CLOSE COMPRAS
           STOP RUN.
       CREAC.
           DISPLAY "NUM. PROVEEDOR:       " LINE 7 POSITION 5
           DISPLAY "FECHA.........:   /  /92" LINE 10 POSITION 5
           DISPLAY "TOTAL COBRADO.:      " LINE 13 POSITION 5
           ACCEPT CODPROV LINE 7 POSITION 21 TAB ON EXCEPTION TECLA
              CONTINUE
           END-ACCEPT.
           CALL "FECHAS.COB" USING FFECHA VENT
           ACCEPT FTOTALC LINE 13 POSITION 21 TAB
           WRITE REG-COMP.




